### 2. 데이터 입출력

In [85]:
import numpy as np
import pandas as pd

- %%wirtefile 매직 명령어 : 하단에 내용 적어 csv파일 생성

In [86]:
%%writefile data/sample1.csv
c1,c2,c3
1,1.11,one
2,2.22,two
3,3.33,three

Overwriting data/sample1.csv

- CSV 파일 읽기

In [87]:
df = pd.read_csv('data/sample1.csv')
df

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

In [88]:
df.columns

Index(['c1', 'c2', 'c3'], dtype='object')

- header 라인이 생략된경우

In [89]:
%%writefile data/sample2.csv
1,1.11,one
2,2.22,two
3,3.33,three

Overwriting data/sample2.csv

In [90]:
df2 = pd.read_csv('data/sample2.csv')
df2

   1  1.11    one
0  2  2.22    two
1  3  3.33  three

In [91]:
df2 = pd.read_csv('data/sample2.csv', names=['c1', 'c2', 'c3'])
df2

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

In [92]:
# index column 지정
df = pd.read_csv('data/sample1.csv', index_col='c1')
df

      c2     c3
c1
1   1.11    one
2   2.22    two
3   3.33  three

- 탭 또는 여러개의 공백으로 구분된 파일

In [93]:
%%writefile data/sample3.tsv
c1    c2    c3    c4
0.179181    -1.538472    1.347553    0.43381
1.024209    0.087307    -1.281997    0.49265
0.417899    -2.002308    0.255245    -1.10515

Overwriting data/sample3.tsv

In [94]:
df = pd.read_csv('data/sample3.tsv', sep='\s+')     # blank 여러개 또는 탭: \s+
df

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

- Header가 여러줄인 경우

In [95]:
%%writefile data/sample4.csv
파일 제목: sample4.txt
데이터 포맷의 설명:
c1,c2,c3
1,1.11,one
2,2.22,two
3,3.33,three

Overwriting data/sample4.csv

In [96]:
df = pd.read_csv('data/sample4.csv', skiprows=2)
df

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

- CSV 파일 출력

In [97]:
df.to_csv('data/sample7.csv', index=False)      # index=False 해줘야 의도치 않은 칼럼생성 방지
df = pd.read_csv('data/sample7.csv')
df

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

- 인터넷 상의 파일

In [98]:
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")

In [99]:
df1 = df.head()
df1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [100]:
# Name, Ticket column 지우고, data/titanic.csv로 저장
del df1['Name']
del df1['Ticket']
df1

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,71.2833,C85,C
2,3,1,3,female,26.0,0,0,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,53.1000,C123,S
4,5,0,3,male,35.0,0,0,8.0500,NaN,S

In [101]:
df1.to_csv('data/titanic.csv', index=False)

In [102]:
pd.read_csv('data/titanic.csv')

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,71.2833,C85,C
2,3,1,3,female,26.0,0,0,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,53.1000,C123,S
4,5,0,3,male,35.0,0,0,8.0500,NaN,S

In [104]:
# 여러 컬럼을 삭제할 경우에는 drop method 고려 가능
df1 = df.head()
df1.drop(columns=['Name', 'Ticket'], inplace=True)
df1

C:\Users\choib\AppData\Local\Temp\ipykernel_12392\3642582902.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1.drop(columns=['Name', 'Ticket'], inplace=True)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,71.2833,C85,C
2,3,1,3,female,26.0,0,0,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,53.1000,C123,S
4,5,0,3,male,35.0,0,0,8.0500,NaN,S